In [179]:
import pandas as pd
import numpy as np

In [181]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Davivd', 'Emome'],
    'Age': [25, 30, 27, 42, 22],
    'Place': ['LA', 'NYC', 'Chicago', 'US', 'Delhi']
}

In [183]:
df = pd.DataFrame(data)

In [185]:
df['Score'] = [85, 90, 78, 92, 88]

In [187]:
df

      Name  Age    Place  Score
0    Alice   25       LA     85
1      Bob   30      NYC     90
2  Charlie   27  Chicago     78
3   Davivd   42       US     92
4    Emome   22    Delhi     88

In [188]:
df.sort_index()

      Name  Age    Place  Score
0    Alice   25       LA     85
1      Bob   30      NYC     90
2  Charlie   27  Chicago     78
3   Davivd   42       US     92
4    Emome   22    Delhi     88

In [189]:
df['Score'] = df['Score']+5

In [192]:
df

      Name  Age    Place  Score
0    Alice   25       LA     90
1      Bob   30      NYC     95
2  Charlie   27  Chicago     83
3   Davivd   42       US     97
4    Emome   22    Delhi     93

In [194]:
df = df.drop('Place', axis=1)

In [196]:
df

      Name  Age  Score
0    Alice   25     90
1      Bob   30     95
2  Charlie   27     83
3   Davivd   42     97
4    Emome   22     93

In [198]:
sortByAge = df.sort_values(by='Age')

In [200]:
sortByAge

      Name  Age  Score
4    Emome   22     93
0    Alice   25     90
2  Charlie   27     83
1      Bob   30     95
3   Davivd   42     97

In [202]:
sortByIndex = df.sort_index(ascending=False)

In [204]:
sortByIndex

      Name  Age  Score
4    Emome   22     93
3   Davivd   42     97
2  Charlie   27     83
1      Bob   30     95
0    Alice   25     90

In [205]:
df = df.rename(columns={'Score': 'Final Score'})

In [209]:
df

      Name  Age  Final Score
0    Alice   25           90
1      Bob   30           95
2  Charlie   27           83
3   Davivd   42           97
4    Emome   22           93

In [211]:
dataWith_nan = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Davivd', 'Emome'],
    'Age': [25, None, 27, None, 22],
    'Score': [22,  78, 44, 99, 75]
}

In [213]:
df_nan = pd.DataFrame(dataWith_nan)

In [215]:
df_nan

      Name   Age  Score
0    Alice  25.0     22
1      Bob   NaN     78
2  Charlie  27.0     44
3   Davivd   NaN     99
4    Emome  22.0     75

In [217]:
df_nan.dropna()

      Name   Age  Score
0    Alice  25.0     22
2  Charlie  27.0     44
4    Emome  22.0     75

In [219]:
df_nan['Name'].replace({'Alice':'Alex', 'Bob':'Barbara'})

0       Alex
1    Barbara
2    Charlie
3     Davivd
4      Emome
Name: Name, dtype: object

In [221]:
pd.DataFrame(df_nan)

      Name   Age  Score
0    Alice  25.0     22
1      Bob   NaN     78
2  Charlie  27.0     44
3   Davivd   NaN     99
4    Emome  22.0     75

In [227]:
df_nan['Score'] = df_nan['Score'].replace(0,'N/A')

In [229]:
df_nan

      Name   Age  Score
0    Alice  25.0     22
1      Bob   NaN     78
2  Charlie  27.0     44
3   Davivd   NaN     99
4    Emome  22.0     75